BaskInNight/xiaojing-esp32-firmware/test_apps/boot_smoke/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: Octal 80MHz (same as unit test app)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Disable BLE
CONFIG_BT_ENABLED=n

# Minimal app stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Disable watchdog for clean boot test
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_INT_WDT=n
CONFIG_BOOTLOADER_WDT_ENABLE=n

# Disable coredump (not needed for boot test)
CONFIG_ESP_COREDUMP_ENABLE_TO_NONE=y
